In [6]:
import pandas as pd 

df1 = pd.read_excel("File\\stock price.xlsx", engine="openpyxl")
df2 = pd.read_excel("File\\stock valuation.xlsx", engine="openpyxl")

print(df1.head())
print(df2.head())
merge_inner = pd.merge(df1, df2)

print(merge_inner)
merge_outer = pd.merge(df1, df2, how="outer", on="id")
merge_left = pd.merge(df1, df2, how="left", left_on="stock_name", right_on="name")

price = df1[df1["price"]<50000]
print(price.head(n=10))

value = pd.merge(price, df2)

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
       id     name           eps     bps        per       pbr
0  130960   CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480       하림    274.166667    3551  11.489362  0.887074
2  138040  메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480      이마트  18268.166667  295780  13.931338  0.860437
4  145990      삼양사   5741.000000  108090  14.283226  0.758627
       id stock_name          value   price    name           eps     bps  \
0  130960     CJ E&M   58540.666667   98900  CJ E&M   6301.333333   54068
1  139480        이마트  239230.833333  254500     이마트  18268.166667  295780
2  145990        삼양사   82750.000000   82000     삼양사   5741.000000  108090
3  185750        종근당   40293.666667  100500     종근당   3990.333333   40684
4  204210     모두투어리츠    3093.333333    3475  모두투어리츠     85.166667    5335

         per       pbr
0  15.695091  1.829178
1  13.931338  0.860437
2  14.283226  0.758627
3  25.185866  2.470259
4  40.802348  0.651359
       id stock_name         value  price
2  138250      엔에스쇼핑  14558.666667  13200
4  142280     녹십자엠에스    468.833333  10200
9  204210     모두투어리츠   3093.333333   3475

In [12]:
import pandas as pd 

df1 = pd.read_excel("File\\stock price.xlsx", index_col="id", engine="openpyxl")
df2 = pd.read_excel("File\\stock valuation.xlsx", index_col="id", engine="openpyxl")

df3 = df1.join(df2)
df4 = df1.join(df2, how="inner")

print(df3.head(n=10))
print(df4.head(n=10))

       stock_name          value   price    name           eps       bps  \
id
128940       한미약품   59385.666667  421000     NaN           NaN       NaN
130960     CJ E&M   58540.666667   98900  CJ E&M   6301.333333   54068.0
138250      엔에스쇼핑   14558.666667   13200     NaN           NaN       NaN
139480        이마트  239230.833333  254500     이마트  18268.166667  295780.0
142280     녹십자엠에스     468.833333   10200     NaN           NaN       NaN
145990        삼양사   82750.000000   82000     삼양사   5741.000000  108090.0
185750        종근당   40293.666667  100500     종근당   3990.333333   40684.0
192400      쿠쿠홀딩스  179204.666667  177500     NaN           NaN       NaN
199800         툴젠   -2514.333333  115400     NaN           NaN       NaN
204210     모두투어리츠    3093.333333    3475  모두투어리츠     85.166667    5335.0

              per       pbr
id
128940        NaN       NaN
130960  15.695091  1.829178
138250        NaN       NaN
139480  13.931338  0.860437
142280        NaN       NaN
145990  14.283226  0.758627
185750  25.185866  2.470259
192400        NaN       NaN
199800        NaN       NaN
204210  40.802348  0.651359
       stock_name          value   price    name           eps     bps  \
id
130960     CJ E&M   58540.666667   98900  CJ E&M   6301.333333   54068
139480        이마트  239230.833333  254500     이마트  18268.166667  295780
145990        삼양사   82750.000000   82000     삼양사   5741.000000  108090
185750        종근당   40293.666667  100500     종근당   3990.333333   40684
204210     모두투어리츠    3093.333333    3475  모두투어리츠     85.166667    5335

              per       pbr
id
130960  15.695091  1.829178
139480  13.931338  0.860437
145990  14.283226  0.758627
185750  25.185866  2.470259
204210  40.802348  0.651359

In [26]:
import pandas as pd 
import seaborn as sns 

titanic = sns.load_dataset("titanic")
df = titanic.loc[:, ["age", "sex", "class", "fare", "survived"]]
print(len(df))
grouped = df.groupby("class")
# print(len(grouped))
# print(grouped.head(n=10))
# print(type(grouped))
df["count"] = 4
count = []
for k, g in grouped:
    print(k)
    count.append(len(g))
    print(g.head())
    print(type(g))

average = grouped.mean()
print(grouped.get_group("First"))

891
First
     age     sex  class     fare  survived  count
1   38.0  female  First  71.2833         1      4
3   35.0  female  First  53.1000         1      4
6   54.0    male  First  51.8625         0      4
11  58.0  female  First  26.5500         1      4
23  28.0    male  First  35.5000         1      4
<class 'pandas.core.frame.DataFrame'>
Second
     age     sex   class     fare  survived  count
9   14.0  female  Second  30.0708         1      4
15  55.0  female  Second  16.0000         1      4
17   NaN    male  Second  13.0000         1      4
20  35.0    male  Second  26.0000         0      4
21  34.0    male  Second  13.0000         1      4
<class 'pandas.core.frame.DataFrame'>
Third
    age     sex  class     fare  survived  count
0  22.0    male  Third   7.2500         0      4
2  26.0  female  Third   7.9250         1      4
4  35.0    male  Third   8.0500         0      4
5   NaN    male  Third   8.4583         0      4
7   2.0    male  Third  21.0750         0      4
<class 'pandas.core.frame.DataFrame'>
      age     sex  class     fare  survived  count
1    38.0  female  First  71.2833         1      4
3    35.0  female  First  53.1000         1      4
6    54.0    male  First  51.8625         0      4
11   58.0  female  First  26.5500         1      4
23   28.0    male  First  35.5000         1      4
..    ...     ...    ...      ...       ...    ...
871  47.0  female  First  52.5542         1      4
872  33.0    male  First   5.0000         0      4
879  56.0  female  First  83.1583         1      4
887  19.0  female  First  30.0000         1      4
889  26.0    male  First  30.0000         1      4

[216 rows x 6 columns]

In [32]:
import pandas as pd 
import seaborn as sns 

titanic = sns.load_dataset("titanic")
df = titanic.loc[:, ["age", "sex", "class", "fare", "survived"]]

grouped_two = df.groupby(["class", "sex"])
print(type(grouped_two))

for k, g in grouped_two:
    print(k)
    print("number", len(grouped_two))
    print(grouped_two.head())
    print(grouped_two.head())
    print("\n")
    
average_two = grouped_two.mean()
print(average_two)
print(type(average_two))
group3f = grouped_two.get_group(("Third", "female"))
print(group3f.head())

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
('First', 'female')
number 6
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0


('First', 'male')
number 6
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0


('Second', 'female')
number 6
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0


('Second', 'male')
number 6
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0


('Third', 'female')
number 6
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0


('Third', 'male')
number 6
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
     age     sex   class      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0


                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447
<class 'pandas.core.frame.DataFrame'>
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0

In [41]:
import pandas as pd 
import seaborn as sns 

titanic = sns.load_dataset("titanic")
df = titanic.loc[:, ["age", "sex", "class", "fare", "survived"]]
grouped = df.groupby(["class"])
std_all = grouped.std()

std_fate = grouped.fare.std()

def min_max(x):
    return x.max() - x.min()

agg_minmax = grouped.agg(min_max)
print(agg_minmax)


agg_ssp = grouped.agg({"fare":["min", "max"], "age":"mean"})
print(agg_ssp)

          age      fare  survived
class
First   79.08  512.3292         1
Second  69.33   73.5000         1
Third   73.58   69.5500         1
       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

C:\Users\lio22\AppData\Local\Temp\ipykernel_14328\2053155736.py:14: FutureWarning: ['sex'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  agg_minmax = grouped.agg(min_max)

In [45]:
import pandas as pd 
import seaborn as sns 

titanic =sns.load_dataset("titanic")
df = titanic.loc[:, ["age", "sex", "class", "fare", "survived"]]

grouped = df.groupby(["class"])
age_mean = grouped.age.mean()
print(age_mean)

age_std = grouped.age.std()
print(age_std)

for key, group in grouped.age: 
    print("origin : " , key)
    group_zscore = (group - age_mean.loc[key]) / age_std.loc[key]
    print(group_zscore.head())
    print("\n")

def z_score(x):
    return (x - x.mean())/x.std()


age_zscore = grouped.age.transform(z_score)
print("\n")
print(age_zscore.head(n=10))

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64
class
First     14.802856
Second    14.001077
Third     12.495398
Name: age, dtype: float64
origin :  First
1    -0.015770
3    -0.218434
6     1.065103
11    1.335321
23   -0.691315
Name: age, dtype: float64


origin :  Second
9    -1.134029
15    1.794317
17         NaN
20    0.365855
21    0.294432
Name: age, dtype: float64


origin :  Third
0   -0.251342
2    0.068776
4    0.789041
5         NaN
7   -1.851931
Name: age, dtype: float64




0   -0.251342
1   -0.015770
2    0.068776
3   -0.218434
4    0.789041
5         NaN
6    1.065103
7   -1.851931
8    0.148805
9   -1.134029
Name: age, dtype: float64

In [52]:
import pandas as pd 
import seaborn as sns 

titanic = sns.load_dataset("titanic")
df = titanic.loc[:, ["age", "sex", "class", "fare", "survived"]]
grouped = df.groupby(["class"])
grouped_filter1 = grouped.filter(lambda x : len(x) >= 200)
# print(grouped_filter1.head(n=15))
print(len(grouped_filter1))

grouped_filter2 = grouped.filter(lambda x : x.age.mean()< 30)
grouped_filter3 = grouped.apply(lambda x : x.age.mean() < 30)
print(grouped_filter2.head(n=10))
print(len(grouped_filter2))
print(grouped_filter3.head(n=10))
print(len(grouped_filter3))
# print(grouped_filter3)

for x in grouped_filter3.index:
    if grouped_filter3[x] == True : 
        age_filter_df = grouped.get_group(x)
        print(age_filter_df.head())
        print("\n")

707
     age     sex   class     fare  survived
0   22.0    male   Third   7.2500         0
2   26.0  female   Third   7.9250         1
4   35.0    male   Third   8.0500         0
5    NaN    male   Third   8.4583         0
7    2.0    male   Third  21.0750         0
8   27.0  female   Third  11.1333         1
9   14.0  female  Second  30.0708         1
10   4.0  female   Third  16.7000         1
12  20.0    male   Third   8.0500         0
13  39.0    male   Third  31.2750         0
675
class
First     False
Second     True
Third      True
dtype: bool
3
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1


    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0